# -*- coding=utf-8 -*-

# driver必须为全局变量，否则会出现浏览器打开闪退
import os
import time
from selenium import webdriver


def get_cities_test():
    """
    :return: 为了加快测试的数据集
    """
    return {"北京": ["延庆区", "怀柔区", "平谷区", "密云区"],
            "上海": ["青浦区", "闸北区", "奉贤区", "金山区"]
            }


def get_cities():
    """
    :return: 主要城市数据集
    """
    return {"北京": ["朝阳区", "海淀区", "东城区", "大兴区", "西城区", "丰台区", "昌平区", "通州区", "顺义区", "石景山区", "房山区", "门头沟区", "延庆区", "怀柔区",
                   "平谷区", "密云区"],
            "上海": ["浦东新区", "徐汇区", "闵行区", "长宁区", "杨浦区", "静安区", "黄浦区", "普陀区", "虹口区", "嘉定区", "宝山区", "松江区", "青浦区", "闸北区",
                   "奉贤区", "金山区", "崇明县"],
            "深圳": ["南山区", "福田区", "宝安区", "龙岗区", "龙华新区", "罗湖区", "光明新区", "坪山新区", "盐田区", "大鹏新区"],
            "广州": ["天河区", "海珠区", "番禺区", "白云区", "越秀区", "黄埔区", "荔湾区", "南沙区", "花都区", "萝岗区", "增城", "从化"],
            "重庆": ["渝北区", "渝中区", "江北区", "南岸区", "九龙坡区", "沙坪坝区", "巴南区", "永川区", "江津区", "大渡口区", "北碚区", "合川区", "万州区", "大足县",
                   "荣昌区", "璧山县", "长寿区", "南川区", "铜梁区", "涪陵区", "潼南区", "綦江区", "云阳县", "垫江县", "彭水苗族土家族自治县", "丰都县", "忠县",
                   "双桥区", "万盛区", "酉阳县", "开县", "梁平县"],
            "成都": ["高新区", "武侯区", "锦江区", "青羊区", "金牛区", "成华区", "双流县", "郫县", "龙泉驿区", "新都区", "温江区", "青白江区", "彭州市", "崇州市",
                   "金堂县", "新津县", "都江堰市", "邛崃市", "蒲江县", "大邑县"],
            "杭州": ["西湖区", "余杭区", "滨江区", "江干区", "拱墅区", "萧山区", "下城区", "下沙", "上城区", "富阳市", "临安市", "桐庐县", "建德市", "淳安县"],
            "南京": ["雨花台区", "江宁区", "建邺区", "秦淮区", "鼓楼区", "玄武区", "浦口区", "栖霞区", "六合区", "溧水区", "高淳区"],
            "苏州": ["工业园区", "吴中区", "昆山市", "姑苏区", "相城区", "虎丘区", "吴江区", "高新区", "常熟市", "张家港市", "太仓市"],
            "武汉": ["洪山区", "东湖新技术开发区", "江夏区", "武昌区", "江汉区", "江岸区", "汉阳区", "硚口区", "东西湖区", "黄陂区", "武汉经济技术开发区", "蔡甸区",
                   "青山区", "新洲区", "汉南区", "武汉吴家山经济技术开发区"],

            "郑州": ["金水区", "郑东新区", "管城回族区", "二七区", "中原区", "高新区", "管城区", "新郑市", "经开区", "惠济区", "中牟县", "航空港区", "荥阳市", "登封市",
                   "新密市", "上街区", "巩义市"],
            "西安": ["雁塔区", "高新技术产业开发区", "未央区", "碑林区", "莲湖区", "新城区", "长安区", "经济技术开发区", "曲江新区", "灞桥区", "浐灞生态区",
                   "西安国家民用航天产业基地", "国际港务区", "高陵县", "沣渭新区", "临潼区", "户县", "周至县", "阎良区", "蓝田县"],
            "青岛": ["市北区", "市南区", "黄岛区", "崂山区", "城阳区", "李沧区", "胶州市", "即墨市", "青岛经济技术开发区", "青岛高新技术产业开发区", "莱西市", "平度市",
                   "保税区"],
            "天津": ["西青区", "南开区", "和平区", "滨海新区", "河西区", "河东区", "红桥区", "津南区", "武清区", "河北区", "东丽区", "北辰区", "静海县", "宝坻区",
                   "蓟县", "宁河县"],
            "长沙": ["岳麓区", "开福区", "雨花区", "芙蓉区", "天心区", "长沙县", "望城区", "浏阳市", "宁乡县"],
            "宁波": ["鄞州区", "海曙区", "江北区", "慈溪市", "镇海区", "北仑区", "余姚市", "江东区", "奉化市", "宁海县", "象山县"],
            "无锡": ["梁溪区", "新吴区", "滨湖区", "锡山区", "无锡新区", "江阴市", "惠山区", "宜兴市", "崇安区", "南长区", "北塘区"],
            "佛山": ["南海区", "顺德区", "禅城区", "三水区", "高明区"],
            "厦门": ["思明区", "湖里区", "集美区", "海沧区", "翔安区", "同安区"],
            "合肥": ["蜀山区", "高新区", "包河区", "瑶海区", "庐阳区", "经济技术开发区", "政务文化新区", "滨湖新区", "肥西县", "长丰县", "肥东县", "新站综合开发试验区",
                   "北城新区", "庐江县", "巢湖市"],

            "东莞": ["东莞市辖区"]
            }


def get_current_dir():
    """
    :return: 获得当前运行文件的工作目录
    """
    return os.path.abspath('.')


def get_parent_dir():
    """
    :return: 获取当前执行路径下的父文件目录
    """
    return os.path.abspath(os.path.dirname(os.getcwd()))


def get_csv_path(job, platform):
    """
    定义CSV文件命名规则
    :return     :获取保存文件的路径
    """
    return get_current_date() + '_raw_' + job + "_" + platform + '.csv'


def open_url(path):
    """
    打开指定的网页
    :param path:
    """
    if path.find("file") <= 0:
        path += "file://"
    # 这句话使用的时候要放在全局（方法外部），否则会引起浏览器页面闪退
    # driver = webdriver.Chrome()
    # driver.get(path)


def get_current_date():
    """
    :return: 获取当前日期
    """
    return time.strftime("%Y%m%d", time.localtime())
